UT_Marketplaces.Marketplaces/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UT_Marketplaces.Marketplaces/src/AccumulationRegisters/ТоварыВЯчейках/ТоварыВЯчейках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ea232e9c-2f7d-4380-8ea3-543f63d0a155">
  <name>ТоварыВЯчейках</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="ac969acb-7b93-4fb5-88a4-8ffafa290913">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ad99eb3f-4b74-4ff7-9e1d-cd183c5b0e92">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0a6c4713-63ad-4653-9246-ca23ce97306a">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2eac0d5a-dc44-4ecb-9f52-9d0e1da89e1c">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="265cd379-3a79-4a3e-90cb-05a495db16e5">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1bee65a5-d081-4d90-a770-1169426b8977">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/CommonModules/ОстаткиСервер/Module.bsl
Функция ПолучитьОстаткиНаСкладах(Номенклатура, Характеристика) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад.Наименование КАК Склад,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладахОстатки.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;		
	
КонецФункции      

Функция ПолучитьОстаткиВЯчейках(Номенклатура, Характеристика) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Ячейка.Наименование КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ТоварыВЯчейкахОстатки.Ячейка.Владелец.Наименование КАК Склад
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Период) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыВЯчейкахОстатки.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;		
	
КонецФункции

Функция ПолучитьОстаткиВЯчейке(Ячейка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ТоварыВЯчейкахОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ТоварыВЯчейкахОстатки.Характеристика.Наименование КАК ХарактеристикаНаименование
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Период) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьОстаткиВЯчейкеДляРазмещения(Результат, Ячейка) Экспорт
	
	ЕстьСерии = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК НоменклатураСсылка,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК ХарактеристикаСсылка,
		|	ТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмерения КАК УпаковкаСсылка,
		|	ТоварыВЯчейкахОстатки.Серия КАК СерияСсылка,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Номенклатура) КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Характеристика) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмерения) КАК Упаковка,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВЯчейкахОстатки.Серия) КАК Серия
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Период, ) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка = &Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Номенклатура) КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика) КАК Характеристика,
		|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Упаковка) КАК Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодНоменклатуры,
		|	ЕСТЬNULL("+Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки("ШтрихкодыНоменклатуры.Упаковка","ШтрихкодыНоменклатуры.Номенклатура")+", 1) КАК КоэффициентУпаковки
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	(ШтрихкодыНоменклатуры.Номенклатура, ШтрихкодыНоменклатуры.Характеристика, ШтрихкодыНоменклатуры.Упаковка) В
		|			(ВЫБРАТЬ
		|				ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|				ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
		|				ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка
		|			ИЗ
		|				РегистрНакопления.ТоварыВЯчейках.Остатки(&Период, ) КАК ТоварыВЯчейкахОстатки
		|			ГДЕ
		|				ТоварыВЯчейкахОстатки.Ячейка = &Ячейка)";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = МассивРезультатов[0].Выгрузить();
	РезультатЗапроса2 = МассивРезультатов[1].Выгрузить();
	
	РезультатЗапроса.Колонки.Добавить("ГУИДНоменклатуры", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ГУИДХарактеристики", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ГУИДУпаковки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ГУИДСерии", Новый ОписаниеТипов("УникальныйИдентификатор"));
	РезультатЗапроса.Колонки.Добавить("ШтрихкодСерии", Новый ОписаниеТипов("Строка"));
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		Строка.ГУИДНоменклатуры = Строка.НоменклатураСсылка.УникальныйИдентификатор();
		Строка.ГУИДХарактеристики = Строка.ХарактеристикаСсылка.УникальныйИдентификатор();
		Строка.ГУИДУпаковки = Строка.УпаковкаСсылка.УникальныйИдентификатор();
		
		Если ЗначениеЗаполнено(Строка.СерияСсылка) Тогда
			Строка.ШтрихкодСерии = РаботаСШтрихкодами.ПолучитьШК(Строка.СерияСсылка);
			Строка.ГУИДСерии = Строка.СерияСсылка.УникальныйИдентификатор(); 
			ЕстьСерии = Истина;
		КонецЕсли;
	КонецЦикла;
	РезультатЗапроса.Колонки.Удалить("НоменклатураСсылка");
	РезультатЗапроса.Колонки.Удалить("ХарактеристикаСсылка");
	РезультатЗапроса.Колонки.Удалить("УпаковкаСсылка");
	РезультатЗапроса.Колонки.Удалить("СерияСсылка");
	
	Результат.Вставить("ТаблицаТоваров", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));		
	Результат.Вставить("ТаблицаШК",ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса2));		
	Результат.Вставить("ЕстьСерии", ЕстьСерии);
	Результат.Вставить("Ячейка", Ячейка.Наименование);
	Результат.Вставить("ГУИДЯчейки", Ячейка.УникальныйИдентификатор());
    Результат.Успешно = Истина;
	Возврат Результат;
КонецФункции
